##pandas read_csv

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("./dogNames2.csv")
print(df)

      Row_Labels  Count_AnimalName
0              1                 1
1              2                 2
2          40804                 1
3          90201                 1
4          90203                 1
...          ...               ...
16215      37916                 1
16216      38282                 1
16217      38583                 1
16218      38948                 1
16219      39743                 1

[16220 rows x 2 columns]

In [9]:
pd.DataFrame(np.arange(12).reshape(3, 4))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [10]:
pd.DataFrame(np.arange(12).reshape(3, 4), 
             index=list('abc'), columns=list("wxyz"))

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [13]:
d1 = {"name" : ["xiaoming", "xiaohong"], 
      "age": [20, 32],
      "tel": [10086, 10010]}
d1 = pd.DataFrame(d1)
d1

       name  age    tel
0  xiaoming   20  10086
1  xiaohong   32  10010

In [15]:
d2 = [{"name" : "xiaohong", "age" : 32 , "tel" : 10010},
      {"name" : "xiaogang",              "tel" : 10000},
      {"name" : "xiaohong", "age" : 11 }]
d2 = pd.DataFrame(d2)
d2

       name   age      tel
0  xiaohong  32.0  10010.0
1  xiaogang   NaN  10000.0
2  xiaohong  11.0      NaN

In [17]:
d2.dtypes

name     object
age     float64
tel     float64
dtype: object

In [21]:
print(df.describe())

       Count_AnimalName
count      16220.000000
mean           6.558631
std           31.862511
min            1.000000
25%            1.000000
50%            1.000000
75%            3.000000
max         1195.000000

In [22]:
print(df.head())

  Row_Labels  Count_AnimalName
0          1                 1
1          2                 2
2      40804                 1
3      90201                 1
4      90203                 1

In [23]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16220 entries, 0 to 16219
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Row_Labels        16217 non-null  object
 1   Count_AnimalName  16220 non-null  int64
dtypes: int64(1), object(1)
memory usage: 253.6+ KB
None

In [37]:
# dataframe中的排序方法
df = df.sort_values(by="Count_AnimalName", ascending=False)
# print(df.head(10))
# pandas取行或者列的注意点
# -方括号写数字, 表示对行操作
# -写字符串, 表示的取列索引, 对列操作
print(df[:20])
print("*" *50)
print(df["Row_Labels"][:10])

      Row_Labels  Count_AnimalName
1156       BELLA              1195
9140         MAX              1153
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823
8417        LOLA               795
8552       LUCKY               723
8560        LUCY               710
2032       BUDDY               677
3641       DAISY               649
11703   PRINCESS               603
829       BAILEY               532
9766       MOLLY               519
14466      TEDDY               485
2913       CHLOE               465
14779       TOBY               446
8620        LUNA               432
6515        JACK               425
8788      MAGGIE               393
10750       OREO               383
**************************************************
1156       BELLA
9140         MAX
2660     CHARLIE
3251        COCO
12368      ROCKY
8417        LOLA
8552       LUCKY
8560        LUCY
2032       BUDDY
3641       DAISY
Name: Row_Labels, dtype: object